# GetElementId Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..GetElementId Method
AnalyticalModel Class See Also
---
Retrieves Element Id of the structural element corresponding to the Analytical Model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId GetElementId()
```

Visual Basic
---
```text
Public Function GetElementId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetElementId()
```

# ### Return Value
Element Id for a structural element.
# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace